/**
 * @ClassName: StringTest
 * @Description: test
 * @Author: lijun
 * @Date: 2019/4/19 0019下午 3:15
 * @Version: 1.0.0$
 **/
public class StringTest {

    public static void main(String[] args) {


        for (int i = 0; i < 1000000; i++) {
            String str = "你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱你是大法官高低贵贱";
            str.intern();
        }
    }
}
